       IDENTIFICATION DIVISION.
       PROGRAM-ID.EX7.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT INV ASSIGN TO DISK
       ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD INV
       LABEL RECORDS ARE STANDARD
       VALUE OF FILE-ID IS "INVENT.txt"
       DATA RECORD IS REC.
       01 REC.
       02 PN PIC A(20).
       02 PQ PIC 9(6).
       02 SLT PIC A(3).
       02 D PIC A(10).
       WORKING-STORAGE SECTION.
       01 OP PIC 9.
       01 PN1 PIC A(20).
       01 PQ1 PIC 9(6).
       01 SLT1 PIC A(3).
       01 D1 PIC A(10).
       01 PQT PIC 9(6).
       01 D2 PIC A(10).
       PROCEDURE DIVISION.
       MAINPARA.
       DISPLAY "INVENTORY MANAGEMENT".
       DISPLAY "1. INPUT STOCK DETAILS".
       DISPLAY "2. REPORT".
       DISPLAY "3. EXIT".
       DISPLAY "4. REPORT FOR DATEWISE".
       DISPLAY "ENTER YOUR CHOICE".
       ACCEPT OP.
       IF OP=1
       GO TO INPUTPARA
       ELSE IF OP=2
       GO TO REPORTPARA
       ELSE IF OP=3
       GO TO ENDOFP
       ELSE
       GO TO REPORTDATE.
       INPUTPARA.
       OPEN EXTEND INV.
       DISPLAY "ENTER PRODUCT NAME".
       ACCEPT PN.
       DISPLAY "ENTER QUANTITY".
       ACCEPT PQ.
       DISPLAY "TYPE OF FLOW(IN OR OUT)".
       ACCEPT SLT.
       DISPLAY "ENTER DATE".
       ACCEPT D.
       WRITE REC.
       CLOSE INV.
       GO TO MAINPARA.
       REPORTPARA.
       DISPLAY "REPORT".
       DISPLAY "ENTER PRODUCT NAME".
       ACCEPT PN1.
       OPEN INPUT INV.
       MOVE 0 TO PQT.
       GO TO READREC.
       READREC.
       READ INV AT END GO TO CLOSE-FILE.
       IF PN=PN1
       DISPLAY REC
       IF SLT="IN"
       COMPUTE PQT=PQT+PQ
       ELSE
       COMPUTE PQT=PQT*PQ
       IF PQT<100
       DISPLAY "THE STOCK IS LESS".
       GO TO READREC.
       CLOSE-FILE.
       DISPLAY "TILL THE LAST DATE".
       DISPLAY "STOCK IS" PQT.
       CLOSE INV.
       GO TO MAINPARA.
       ENDOFP.
       DISPLAY "END OF PROGRAM".
       STOP RUN.
       REPORTDATE.
       DISPLAY "REPORT".
       DISPLAY "ENTER DATE".
       ACCEPT D2.
       OPEN INPUT INV.
       GO TO READREC2.
       READREC2.
       READ INV AT END GO TO CLOSE-FILE1.
       DISPLAY REC.
       GO TO READREC2.
       CLOSE-FILE1.
       CLOSE INV.
       GO TO MAINPARA.
